### Mise en place

In [79]:
%reload_ext sql
%sql postgresql://user_tp:ue_bd_ihm_db@localhost/ue_bd_ihm_db

'Connected: user_tp@ue_bd_ihm_db'

### Module de gestion des commentaires (obligatoire)

##### Afficher la liste des membres du compte ayant pour identifiant 1.

In [80]:
%%sql
SELECT id,nom,email, compte_id 
FROM membre JOIN appartenance ON id = membre_id 
WHERE compte_id = 1

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
8 rows affected.

[(1, 'Elizabeth', 'elizabeth@orange.edu', 1),
 (2, 'Patricia', 'patricia@orange.edu', 1),
 (7, 'Lillian', 'lillian@icloud.en', 1),
 (10, 'Julia', 'julia@hotmail.edu', 1),
 (11, 'David', 'david@gmail.en', 1),
 (12, 'Willie', 'willie@imt-atlantique.net', 1),
 (17, 'John', 'john@msf.com', 1),
 (22, 'Aziza', 'khalapoum71@gmail.com', 1)]

##### Afficher la liste des dépenses (avec leur nom, date, montant et catégorie) du compte ayant pour identifiant 1.

In [81]:
%%sql
SELECT membre.nom, date, montant,depense.categorie_nom, depense.compte_id 
FROM depense 
JOIN membre ON depense.membre_id = membre.id
WHERE depense.compte_id = 1

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
9 rows affected.

[('Elizabeth', datetime.date(2022, 3, 13), 105, 'Cadeaux', 1),
 ('Elizabeth', datetime.date(2022, 3, 15), 50, 'Cadeaux', 1),
 ('Elizabeth', datetime.date(2022, 11, 1), 70, 'deplacement', 1),
 ('Patricia', datetime.date(2022, 12, 27), 150, 'vêtement', 1),
 ('Lillian', datetime.date(2022, 3, 10), 240, 'deplacement', 1),
 ('Julia', datetime.date(2022, 3, 1), 10, 'Cadeaux', 1),
 ('Willie', datetime.date(2022, 12, 22), 470, 'loyer', 1),
 ('Aziza', datetime.date(2022, 3, 7), 105, 'Cadeaux', 1),
 ('Aziza', datetime.date(2022, 6, 9), 70, 'deplacement', 1)]

##### Afficher les membres (nom et email) du compte ayant pour identifiant 1 qui doivent rembourser une dépense de la catégorie Cadeaux.

In [82]:
%%sql
SELECT membre.nom, membre.email 
FROM depense
JOIN membre ON  depense.membre_id = membre.id
JOIN compte ON depense.compte_id = compte.id
WHERE depense.compte_id = 1 AND depense.categorie_nom = 'Cadeaux'

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
4 rows affected.

[('Elizabeth', 'elizabeth@orange.edu'),
 ('Elizabeth', 'elizabeth@orange.edu'),
 ('Aziza', 'khalapoum71@gmail.com'),
 ('Julia', 'julia@hotmail.edu')]

##### Afficher, pour le mois de mars 2022, la liste des dépenses pour lesquelles le membre ayant pour identifiant 1 a avancé l’argent.

In [83]:
%%sql
SELECT * 
FROM depense 
WHERE depense.membre_id = 1 AND to_char(date,'mm/yyyy') = '03/2022'

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
3 rows affected.

[(14, 70, datetime.date(2022, 3, 9), 1, 3, 'deplacement'),
 (15, 50, datetime.date(2022, 3, 15), 1, 1, 'Cadeaux'),
 (17, 105, datetime.date(2022, 3, 13), 1, 1, 'Cadeaux')]

##### Afficher par catégorie de dépense, le montant dépensé.

In [84]:
%%sql
SELECT SUM(montant) AS "montant total" , categorie_nom
FROM depense
GROUP BY categorie_nom;

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
5 rows affected.

[(150, 'vêtement'),
 (490, 'Cadeaux'),
 (60, 'nourriture'),
 (1310, 'deplacement'),
 (960, 'loyer')]

### Module de gestion des commentaires (optionnel)

##### Afficher les commentaires par ordre chronologique pour la dépense ayant pour identifiant 1.

In [85]:
%%sql
SELECT date, message 
FROM commentaire 
WHERE depense_id=1
ORDER BY date

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
2 rows affected.

[(datetime.date(2022, 2, 23), 'Depeche'), (datetime.date(2023, 2, 12), 'lol')]

##### Par commentaire et par smiley, affichez le nombre d’utilisateurs l’ayant utilisé si celui-ci est au moins égal à 3.

In [86]:
%%sql
select * from
(SELECT smiley.nom, reaction.commentaire_id, commentaire.message "message du commentaire", count(*) 
FROM reaction
join smiley on reaction.smiley_url=smiley.url
join commentaire on commentaire.id=reaction.commentaire_id
group by smiley.nom, reaction.commentaire_id,commentaire.message) as X WHERE count >= 3

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
2 rows affected.

[('pistolet', 24, 'Il faut payer', 3), ('content', 18, 'lol', 4)]

##### Par dépense supérieure à 100€, affichez le nombre de commentaires si celui-ci est au moins égal à 3.

In [89]:
%%sql
select * from depense

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
19 rows affected.

[(1, 60, datetime.date(2022, 11, 1), 21, 4, 'Cadeaux'),
 (2, 150, datetime.date(2022, 2, 22), 14, 2, 'deplacement'),
 (3, 210, datetime.date(2021, 6, 27), 2, 3, 'deplacement'),
 (4, 160, datetime.date(2021, 12, 10), 6, 2, 'Cadeaux'),
 (5, 60, datetime.date(2021, 9, 21), 8, 5, 'nourriture'),
 (6, 470, datetime.date(2022, 12, 22), 12, 1, 'loyer'),
 (7, 470, datetime.date(2022, 2, 27), 13, 3, 'loyer'),
 (8, 150, datetime.date(2022, 1, 15), 20, 6, 'deplacement'),
 (9, 150, datetime.date(2022, 12, 27), 2, 1, 'vêtement'),
 (10, 350, datetime.date(2022, 12, 22), 12, 5, 'deplacement'),
 (11, 20, datetime.date(2022, 7, 7), 5, 5, 'loyer'),
 (12, 70, datetime.date(2022, 11, 1), 1, 1, 'deplacement'),
 (13, 70, datetime.date(2022, 6, 9), 22, 1, 'deplacement'),
 (14, 70, datetime.date(2022, 3, 9), 1, 3, 'deplacement'),
 (15, 50, datetime.date(2022, 3, 15), 1, 1, 'Cadeaux'),
 (16, 240, datetime.date(2022, 3, 10), 7, 1, 'deplacement'),
 (17, 105, datetime.date(2022, 3, 13), 1, 1, 'Cadeaux'),
 (18, 105, datetime.date(2022, 3, 7), 22, 1, 'Cadeaux'),
 (19, 10, datetime.date(2022, 3, 1), 10, 1, 'Cadeaux')]

In [94]:
%%sql
SELECT * FROM
(SELECT depense_id, montant, COUNT(*) AS nombre FROM commentaire 
full outer join depense on depense.id=commentaire.depense_id
WHERE montant >= 100
GROUP BY depense_id, montant) AS x WHERE nombre >= 3

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
5 rows affected.

[(2, 150, 3), (8, 150, 4), (6, 470, 3), (7, 470, 3), (10, 350, 3)]

##### Afficher sans doublon, la liste des membres du compte ayant pour identifiant 1, n’ayant jamais eu à rembourser une dépense associée à ce même compte.

In [97]:
%%sql
SELECT membre.id, membre.nom, membre.email, compte_id FROM membre 
JOIN appartenance ON membre.id = appartenance.membre_id
WHERE appartenance.compte_id = 1 AND id NOT IN 
(SELECT remboursement.membre_id FROM remboursement
 JOIN depense ON remboursement.membre_id = depense.id
 JOIN appartenance ON appartenance.membre_id = depense.membre_id
 WHERE appartenance.compte_id = 1 GROUP BY remboursement.membre_id)

 * postgresql://user_tp:***@localhost/ue_bd_ihm_db
8 rows affected.

[(1, 'Elizabeth', 'elizabeth@orange.edu', 1),
 (2, 'Patricia', 'patricia@orange.edu', 1),
 (7, 'Lillian', 'lillian@icloud.en', 1),
 (10, 'Julia', 'julia@hotmail.edu', 1),
 (11, 'David', 'david@gmail.en', 1),
 (12, 'Willie', 'willie@imt-atlantique.net', 1),
 (17, 'John', 'john@msf.com', 1),
 (22, 'Aziza', 'khalapoum71@gmail.com', 1)]